In [8]:
a = input("Player 1: even or odd: ")
b = input("Player 2: even or odd: ")
def money():
    a = input("Player 1: Even or odd: ")
    b = input("Player 2: Even or odd: ")
if a==b:
    print("Try again",money())
c = int(input("Player 1 choose a number: "))
d = int(input("Player 2 choose a number: "))
e = c+d
if e%2 ==0:
    print("Even")
else:
    print("Odd")

Player 1: even or odd: odd
Player 2: even or odd: even
Player 1 choose a number: 2
Player 2 choose a number: 4
Even

In [4]:
import pandas

In [2]:
a = [1637281.3, 1729302.5, 1784910.4, 162813.7, 1562732.5, 1265748.7, 1385940.5, 1256473.6, 1748392.6, 1759302.4]
b = [13456781.3, 1654302.5, 1546780.4,176543.7,1234532.5, 1345678.7, 15432140.5, 12554323.6, 17554242.6, 17543212.4]
c = [2563721.3, 3628142.5, 1784910.4, 1643256.7, 15642142.5, 1456788.7, 14325890.5, 4324789.6, 65433678.6, 664347654.4]
d = ["New York", "Califonia", "Florida", "New York", "Florida","New York", "Califonia", "Florida", "New York", "Califonia"]
e = [1637281.3, 1729302.5, 1784910.4, 162813.7, 1562732.5, 1265748.7, 1385940.5, 1256473.6, 1748392.6, 1759302.4]
bat = {'R&D Spend': a, "Administration": b, "Marketing Spend": c, "State": d, "Profit": e}

In [3]:
bat

{'R&D Spend': [1637281.3,
  1729302.5,
  1784910.4,
  162813.7,
  1562732.5,
  1265748.7,
  1385940.5,
  1256473.6,
  1748392.6,
  1759302.4],
 'Administration': [13456781.3,
  1654302.5,
  1546780.4,
  176543.7,
  1234532.5,
  1345678.7,
  15432140.5,
  12554323.6,
  17554242.6,
  17543212.4],
 'Marketing Spend': [2563721.3,
  3628142.5,
  1784910.4,
  1643256.7,
  15642142.5,
  1456788.7,
  14325890.5,
  4324789.6,
  65433678.6,
  664347654.4],
 'State': ['New York',
  'Califonia',
  'Florida',
  'New York',
  'Florida',
  'New York',
  'Califonia',
  'Florida',
  'New York',
  'Califonia'],
 'Profit': [1637281.3,
  1729302.5,
  1784910.4,
  162813.7,
  1562732.5,
  1265748.7,
  1385940.5,
  1256473.6,
  1748392.6,
  1759302.4]}

In [8]:
enron = pandas.DataFrame(bat)

In [9]:
enron

   R&D Spend  Administration  Marketing Spend      State     Profit
0  1637281.3      13456781.3        2563721.3   New York  1637281.3
1  1729302.5       1654302.5        3628142.5  Califonia  1729302.5
2  1784910.4       1546780.4        1784910.4    Florida  1784910.4
3   162813.7        176543.7        1643256.7   New York   162813.7
4  1562732.5       1234532.5       15642142.5    Florida  1562732.5
5  1265748.7       1345678.7        1456788.7   New York  1265748.7
6  1385940.5      15432140.5       14325890.5  Califonia  1385940.5
7  1256473.6      12554323.6        4324789.6    Florida  1256473.6
8  1748392.6      17554242.6       65433678.6   New York  1748392.6
9  1759302.4      17543212.4      664347654.4  Califonia  1759302.4

In [11]:
enron.head(5)

   R&D Spend  Administration  Marketing Spend      State     Profit
0  1637281.3      13456781.3        2563721.3   New York  1637281.3
1  1729302.5       1654302.5        3628142.5  Califonia  1729302.5
2  1784910.4       1546780.4        1784910.4    Florida  1784910.4
3   162813.7        176543.7        1643256.7   New York   162813.7
4  1562732.5       1234532.5       15642142.5    Florida  1562732.5

In [12]:
enron.tail(5)

   R&D Spend  Administration  Marketing Spend      State     Profit
5  1265748.7       1345678.7        1456788.7   New York  1265748.7
6  1385940.5      15432140.5       14325890.5  Califonia  1385940.5
7  1256473.6      12554323.6        4324789.6    Florida  1256473.6
8  1748392.6      17554242.6       65433678.6   New York  1748392.6
9  1759302.4      17543212.4      664347654.4  Califonia  1759302.4

In [17]:
enron.columns

Index(['R&D Spend', 'Administration', 'Marketing Spend', 'State', 'Profit'], dtype='object')

In [30]:
enron.to_excel('enron.xlsx')

In [1]:
pandas.read_excel('enron.xlsx')

NameError: name 'pandas' is not defined

In [32]:
pandas.read_excel('data.xlsx')

   Unnamed: 0      Names  Age  Height  Score Gender
0           0        Ann   14     5.5     80      F
1           1       Jane   16     6.0     85      F
2           2       Joan   14     5.4     70      F
3           3      Clare   17     5.9     60      F
4           4  Elizabeth   16     5.6     76      F
5           5   Chaarles   15     5.7     85      M
6           6       Jude   16     5.9     74      M
7           7      James   16     5.8     87      M
8           8     Kelvin   17     6.1     75      M
9           9    Prosper   14     5.0     68      M

In [22]:
a = float(input('Enter distance in miles:'))
b = float(input('Enter time in hours:'))
c = a/b
print('The speed of the car is:', c, 'miles/hr')

Enter distance in miles:50
Enter time in hours:2
The speed of the car is: 25.0 miles/hr

In [39]:
import math
a = int(input('Enter coefficient of x^2:' ))
b = int(input('Enter coefficient of x:' ))
c = int(input("Enter constant term:" ))
x1 = (-b+math.sqrt(b**2-(4*a*c)))/(2*a)
x2 = (-b-math.sqrt(b**2-(4*a*c)))/(2*a)
print("x1: ",x1)
print("x2: ",x2)

Enter coefficient of x^2:1
Enter coefficient of x:5
Enter constant term:2
x1:  -0.4384471871911697
x2:  -4.561552812808831